VlagaPalych/Stable/STM32/InvenSense/mpu9250.c
#include "stm32f4xx.h" 
#include "mpu9250.h"
#include "dmp.h"
#include "string.h"
#include "extra_math.h"
#include "spi.h"
#include "dma.h"
#include "stdlib.h"
#include "math.h"


#define min(a,b) ((a<b)?a:b)
void Delay_ms(uint16_t ms);
void Delay_us(uint16_t us);

#define MPU_READ_DATA_SIZE 13
uint8_t MPU_DMA_tx[100] = {READ_COMMAND | FIFO_R_W};
uint8_t MPU_DMA_rx[100];

int16_t accel_data[3];
int16_t gyro_data[3];
int32_t quat_data[4];

float accel[3];
float quat[4];
float temp;
float angleRate[3];
float magField[3];

float mag_sens_adj[3];

uint8_t dmp_on = 0;

uint8_t meas1 = 1;
uint8_t process = 0;
extern float w1[3];
extern float w2[3];
extern float v1[3];
extern float v2[3];

MPU_Regs regArray[MPU_MAX_DEVICES];
HW hwArray[MPU_MAX_DEVICES];
MPU_Test testArray[MPU_MAX_DEVICES];
MPU_State gyroArray[MPU_MAX_DEVICES];

MPU_Regs *reg;
HW *hw;
MPU_Test *test;
MPU_State *st;
static int deviceIndex = 0;

static int reg_int_cb(MPU_IntParams *int_param) {
    int_param->active_low = 0;
    int_param->pin = 1;
    return 0;
}

#ifdef AK89xx_SECONDARY
static int setup_compass(void);
#define MAX_COMPASS_SAMPLE_RATE (100)
#endif

int MPU_SelectDevice(int device) {
  if ((device < 0) || (device >= MPU_MAX_DEVICES))
    return -1;

  deviceIndex = device;
  reg = regArray + device;
  hw = hwArray + device;
  test = testArray + device;
  st = gyroArray + device;
  return 0;
}

void MPU_InitStructures() {
    reg->who_am_i         = WHO_AM_I;
    reg->rate_div         = SMPLRT_DIV;
    reg->lpf              = CONFIG;
    reg->prod_id          = 0x0C;
    reg->user_ctrl        = USER_CTRL;
    reg->fifo_en          = FIFO_EN;
    reg->gyro_cfg         = GYRO_CONFIG;
    reg->accel_cfg        = ACCEL_CONFIG;
    reg->accel_cfg2       = ACCEL_CONFIG2;
    reg->lp_accel_odr     = LP_ACCEL_ODR;
    reg->motion_thr       = WOM_THR;
    reg->motion_dur       = 0x20;
    reg->fifo_count_h     = FIFO_COUNTH;
    reg->fifo_r_w         = FIFO_R_W;
    reg->raw_gyro         = GYRO_XOUT_H;
    reg->raw_accel        = ACCEL_XOUT_H;
    reg->temp             = TEMP_OUT_H;
    reg->int_enable       = INT_ENABLE;
    reg->dmp_int_status   = 0x39;
    reg->int_status       = INT_STATUS;
    reg->accel_intel      = MOT_DETECT_CTRL;
    reg->pwr_mgmt_1       = PWR_MGMT_1;
    reg->pwr_mgmt_2       = PWR_MGMT_2;
    reg->int_pin_cfg      = INT_PIN_CFG;
    reg->mem_r_w          = MEM_R_W;
    reg->accel_offs       = XA_OFFSET_H;
    reg->i2c_mst          = I2C_MST_CTRL;
    reg->bank_sel         = BANK_SEL;
    reg->mem_start_addr   = 0x6E;
    reg->prgm_start_h     = PRGM_START_H;
#ifdef AK89xx_SECONDARY
    reg->raw_compass      = EXT_SENS_DATA_00;
    reg->yg_offs_tc       = YG_OFFSET_H;
    reg->s0_addr          = I2C_SLV0_ADDR;
    reg->s0_reg           = I2C_SLV0_REG;
    reg->s0_ctrl          = I2C_SLV0_CTRL;
    reg->s1_addr          = I2C_SLV1_ADDR;
    reg->s1_reg           = I2C_SLV1_REG;
    reg->s1_ctrl          = I2C_SLV1_CTRL;
    reg->s4_ctrl          = I2C_SLV4_CTRL;
    reg->s0_do            = I2C_SLV0_DO;
    reg->s1_do            = I2C_SLV1_DO;
    reg->i2c_delay_ctrl   = I2C_MST_DELAY_CTRL;
#endif
    switch (deviceIndex) {
      case 0:
        hw->addr = 0x68;
        break;

      case 1:
        hw->addr = 0x69;
        break;
    }
    hw->max_fifo          = 1024;
    hw->num_reg           = 128;
    hw->temp_sens         = 321;
    hw->temp_offset       = 0;
    hw->bank_size         = 256;
#if defined AK89xx_SECONDARY
    hw->compass_fsr      = AK89xx_FSR;
#endif

    test->gyro_sens      = 32768/250;
    test->accel_sens     = 32768/16;
    test->reg_rate_div   = 0;    /* 1kHz. */
    test->reg_lpf        = 1;    /* 188Hz. */
    test->reg_gyro_fsr   = 0;    /* 250dps. */
    test->reg_accel_fsr  = 0x18; /* 16g. */
    test->wait_ms        = 50;
    test->packet_thresh  = 5;    /* 5% */
    test->min_dps        = 10.f;
    test->max_dps        = 105.f;
    test->max_gyro_var   = 0.14f;
    test->min_g          = 0.3f;
    test->max_g          = 0.95f;
    test->max_accel_var  = 0.14f;

    st->reg = reg;
    st->hw = hw;
    st->test = test;
};

// 0 if check passed
int MPU_WriteByteAndCheck(uint8_t address, uint8_t data) {
    uint8_t test;
    MPU_WriteByte(address, data);
    test = MPU_ReadByte(address);
    return (test != data);
}

int MPU_WriteAndCheck(uint8_t address, uint8_t *data, uint8_t size) {
    uint8_t *test = (uint8_t *)malloc(size);
    int res = 0;
    MPU_Write(address, data, size);
    MPU_Read(address, test, size);
    if (memcmp(data, test, size)) {
        res = -1;
    }
    free(test);
    return res;
}

/**
 *  @brief      Write to the DMP memory.
 *  This function prevents I2C writes past the bank boundaries. The DMP memory
 *  is only accessible when the chip is awake.
 *  @param[in]  mem_addr    Memory location (bank << 8 | start address)
 *  @param[in]  length      Number of bytes to write.
 *  @param[in]  data        Bytes to write to memory.
 *  @return     0 if successful.
 */
int MPU_MemWrite(uint16_t mem_addr, uint8_t *data, uint16_t length) {
    uint8_t tmp[2];

    if (!data)
        return -1;
    if (!st->chip_cfg.sensors)
        return -2;

    tmp[0] = (uint8_t)(mem_addr >> 8);
    tmp[1] = (uint8_t)(mem_addr & 0xFF);

    /* Check bank boundaries. */
    if (tmp[1] + length > st->hw->bank_size)
        return -3;

    MPU_Write(st->reg->bank_sel, tmp, 2);
    MPU_Write(st->reg->mem_r_w, data, length);
    return 0;
}

/**
 *  @brief      Read from the DMP memory.
 *  This function prevents I2C reads past the bank boundaries. The DMP memory
 *  is only accessible when the chip is awake.
 *  @param[in]  mem_addr    Memory location (bank << 8 | start address)
 *  @param[in]  length      Number of bytes to read.
 *  @param[out] data        Bytes read from memory.
 *  @return     0 if successful.
 */
int MPU_MemRead(uint16_t mem_addr, uint8_t *data, uint16_t length) {
    uint8_t tmp[2];

    if (!data)
        return -1;
    if (!st->chip_cfg.sensors)
        return -2;

    tmp[0] = (uint8_t)(mem_addr >> 8);
    tmp[1] = (uint8_t)(mem_addr & 0xFF);

    /* Check bank boundaries. */
    if (tmp[1] + length > st->hw->bank_size)
        return -3;

    MPU_Write(st->reg->bank_sel, tmp, 2);
    MPU_Read(st->reg->mem_r_w, data, length);
    return 0;
}

int MPU_Init(MPU_IntParams *int_param) {
    uint8_t data[6], rev;
    int errCode;

    /* Reset device. */
    MPU_WriteByte(st->reg->pwr_mgmt_1, BIT_RESET);
    Delay_ms(100);

    /* Wake up chip. */
    MPU_WriteByte(st->reg->pwr_mgmt_1, 0x01);

