VlagaPalych/Stable/STM32/InvenSense/mpu9250.c
void DMA1_Stream3_IRQHandler() {
    uint8_t i = 0;
    int16_t tmp = 0;
    if (DMA1->LISR & DMA_LISR_TCIF3) {
        DMA1->LIFCR = DMA_LIFCR_CTCIF3 | DMA_LIFCR_CHTIF3;
        DMA1_Stream3->CR &= ~DMA_SxCR_EN;
        MPU_NSS_High();
        
        if (DMA1_Stream3->M0AR == (uint32_t)MPU_DMA_rx) {
            DMP_ParseFIFOData(MPU_DMA_rx + 1); 
            
            if (st->chip_cfg.sensors & INV_XYZ_COMPASS) {
                MPU_DMA_tx[0] = READ_COMMAND | EXT_SENS_DATA_00;
                MPU_DMA_Run(MPU_DMA_tx, compass_data, 8);
            }
        } else if (DMA1_Stream3->M0AR == (uint32_t)compass_data) {
            magField[0] = (compass_data[1] | (compass_data[2] >> 8)) * MAG_SENS * st->chip_cfg.mag_sens_adj[0];
            magField[1] = (compass_data[3] | (compass_data[6] >> 8)) * MAG_SENS * st->chip_cfg.mag_sens_adj[1];
            magField[2] = (compass_data[5] | (compass_data[7] >> 8)) * MAG_SENS * st->chip_cfg.mag_sens_adj[2];
        }
        
        
        
        
//        for (i = 0; i < 3; i++) {
//            tmp = (MPU_DMA_rx[2*i+1] << 8) | MPU_DMA_rx[2*i+2];
//            accel[i] = tmp / ACCEL_SENSITIVITY;
//        }
        
//        tmp = (MPU_DMA_rx[7] << 8) | MPU_DMA_rx[8];
//        temp = tmp / TEMP_SENSITIBITY + TEMP_OFFSET;
        
//        for (i = 0; i < 3; i++) {
//            tmp = (MPU_DMA_rx[2*i+7] << 8) | MPU_DMA_rx[2*i+8];
//            angleRate[i] = tmp / GYRO_SENSITIVITY; // for QUEST algorithm
//        }
        
        
        
//        for (i = 0; i < 3; i++) {
//            tmp = MPU_DMA_rx[2*i+15] | (MPU_DMA_rx[2*i+16] << 8);
//            magField[i] = tmp * MAG_SENSITIVITY * mag_sens_adj[i];
//        }
//        magField[2] = -magField[2];
//        swap(&magField[0], &magField[1]);  
        
//        if (meas1) {
//            meas1 = 0;
//            memcpy(w1, accel, VECT_SIZE*sizeof(float));
//            memcpy(w2, magField, VECT_SIZE*sizeof(float));
//            
//            Vect_Norm(w1);
//            Vect_Norm(w2);
//        } else {
//            process = 1;
//            memcpy(v1, accel, VECT_SIZE*sizeof(float));
//            memcpy(v2, magField, VECT_SIZE*sizeof(float));
//            
//            Vect_Norm(v1);
//            Vect_Norm(v2);
//        }
    }
}


/**
 *  @brief      Load and verify DMP image.
 *  @param[in]  length      Length of DMP image.
 *  @param[in]  firmware    DMP code.
 *  @param[in]  start_addr  Starting address of DMP code memory.
 *  @param[in]  sample_rate Fixed sampling rate used when DMP is enabled.
 *  @return     0 if successful.
 */
int MPU_LoadFirmware(uint16_t length, const uint8_t *firmware,
    uint16_t start_addr, uint16_t sample_rate) 
{        
    uint16_t ii;
    uint16_t this_write;

    /* Must divide evenly into st->hw->bank_size to avoid bank crossings. */
#define LOAD_CHUNK  (16)
    uint8_t cur[LOAD_CHUNK], tmp[2];

    if (st->chip_cfg.dmp_loaded)
        /* DMP should only be loaded once. */
        return -1;

    if (!firmware)
        return -2;
        
    for (ii = 0; ii < length; ii += this_write) {
        this_write = min(LOAD_CHUNK, length - ii);
        if (MPU_MemWrite(ii, (uint8_t *)&firmware[ii], this_write)) {
            return -3;
        }
        if (MPU_MemRead(ii, cur, this_write)) {
            return -3;
        }
        if (memcmp(&firmware[ii], cur, this_write)) {
            return -5;
        }
    }

    /* Set program start address. */
    tmp[0] = start_addr >> 8;
    tmp[1] = start_addr & 0xFF;
    if (MPU_WriteAndCheck(st->reg->prgm_start_h, tmp, 2))
        return -6;

    st->chip_cfg.dmp_loaded = 1;
    st->chip_cfg.dmp_sample_rate = sample_rate;
    return 0;
}

/**
 *  @brief      Enable/disable DMP support.
 *  @param[in]  enable  1 to turn on the DMP.
 *  @return     0 if successful.
 */
int MPU_SetDMPState(uint8_t enable) {
    uint8_t tmp;
    if (st->chip_cfg.dmp_on == enable)
        return 0;

    if (enable) {
        if (!st->chip_cfg.dmp_loaded)
            return -1;
        /* Disable data ready interrupt. */
        MPU_SetIntEnable(0);
        /* Disable bypass mode. */
        MPU_SetBypass(0);
        /* Keep constant sample rate, FIFO rate controlled by DMP. */
        MPU_SetSampleRate(st->chip_cfg.dmp_sample_rate);
        /* Remove FIFO elements. */
        MPU_WriteByte(st->reg->fifo_en, 0x00);
        st->chip_cfg.dmp_on = 1;
        /* Enable DMP interrupt. */
        MPU_SetIntEnable(1);
        MPU_ResetFIFO();
    } else {
        /* Disable DMP interrupt. */
        MPU_SetIntEnable(0);
        /* Restore FIFO settings. */
        tmp = st->chip_cfg.fifo_enable;
        MPU_WriteByte(st->reg->fifo_en, st->chip_cfg.fifo_enable);
        st->chip_cfg.dmp_on = 0;
        MPU_ResetFIFO();
    }
    return 0;
}

#define MAX_PACKET_LENGTH (12)

static const uint16_t mpu_st_tb[256] = {
	2620,2646,2672,2699,2726,2753,2781,2808, //7
	2837,2865,2894,2923,2952,2981,3011,3041, //15
	3072,3102,3133,3165,3196,3228,3261,3293, //23
	3326,3359,3393,3427,3461,3496,3531,3566, //31
	3602,3638,3674,3711,3748,3786,3823,3862, //39
	3900,3939,3979,4019,4059,4099,4140,4182, //47
	4224,4266,4308,4352,4395,4439,4483,4528, //55
	4574,4619,4665,4712,4759,4807,4855,4903, //63
	4953,5002,5052,5103,5154,5205,5257,5310, //71
	5363,5417,5471,5525,5581,5636,5693,5750, //79
	5807,5865,5924,5983,6043,6104,6165,6226, //87
	6289,6351,6415,6479,6544,6609,6675,6742, //95
	6810,6878,6946,7016,7086,7157,7229,7301, //103
	7374,7448,7522,7597,7673,7750,7828,7906, //111
	7985,8065,8145,8227,8309,8392,8476,8561, //119
	8647,8733,8820,8909,8998,9088,9178,9270,
	9363,9457,9551,9647,9743,9841,9939,10038,
	10139,10240,10343,10446,10550,10656,10763,10870,
	10979,11089,11200,11312,11425,11539,11654,11771,
	11889,12008,12128,12249,12371,12495,12620,12746,
	12874,13002,13132,13264,13396,13530,13666,13802,
	13940,14080,14221,14363,14506,14652,14798,14946,
	15096,15247,15399,15553,15709,15866,16024,16184,
	16346,16510,16675,16842,17010,17180,17352,17526,
	17701,17878,18057,18237,18420,18604,18790,18978,
	19167,19359,19553,19748,19946,20145,20347,20550,
	20756,20963,21173,21385,21598,21814,22033,22253,
	22475,22700,22927,23156,23388,23622,23858,24097,
	24338,24581,24827,25075,25326,25579,25835,26093,
	26354,26618,26884,27153,27424,27699,27976,28255,
	28538,28823,29112,29403,29697,29994,30294,30597,
	30903,31212,31524,31839,32157,32479,32804,33132
};

#ifdef AK89xx_SECONDARY
static int compass_self_test(void) {
    uint8_t tmp[6];
    uint8_t tries = 10;
    int result = 0x07;
    uint16_t data;

