VlagaPalych/Stable/STM32/InvenSense/mpu9250.c
    gyro_bias[0] = (long)(((long long)gyro_bias[0]<<16) / test->gyro_sens / s);
    gyro_bias[1] = (long)(((long long)gyro_bias[1]<<16) / test->gyro_sens / s);
    gyro_bias[2] = (long)(((long long)gyro_bias[2]<<16) / test->gyro_sens / s);
    accel_bias[0] = (long)(((long long)accel_bias[0]<<16) / test->accel_sens / s);
    accel_bias[1] = (long)(((long long)accel_bias[1]<<16) / test->accel_sens / s);
    accel_bias[2] = (long)(((long long)accel_bias[2]<<16) / test->accel_sens / s);
    /* remove gravity from bias calculation */
    if (accel_bias[2] > 0L)
        accel_bias[2] -= 65536L;
    else
        accel_bias[2] += 65536L;
}

/**
 *  @brief      Trigger gyro/accel/compass self-test for MPU6500/MPU9250
 *  On success/error, the self-test returns a mask representing the sensor(s)
 *  that failed. For each bit, a one (1) represents a "pass" case; conversely,
 *  a zero (0) indicates a failure.
 *
 *  \n The mask is defined as follows:
 *  \n Bit 0:   Gyro.
 *  \n Bit 1:   Accel.
 *  \n Bit 2:   Compass.
 *
 *  @param[out] gyro        Gyro biases in q16 format.
 *  @param[out] accel       Accel biases (if applicable) in q16 format.
 *  @param[in]  debug       Debug flag used to print out more detailed logs. Must first set up logging in Motion Driver.
 *  @return     Result mask (see above).
 */
int MPU_RunSelfTest(long *gyro_bias, long *accel_bias) {
    long gyro_st[3], accel_st[3];
    uint8_t accel_result, gyro_result;
#ifdef AK89xx_SECONDARY
    uint8_t compass_result;
#endif
    int ii;

    int result;
    uint8_t accel_fsr, fifo_sensors, sensors_on;
    uint16_t gyro_fsr, sample_rate, lpf;
    uint8_t dmp_was_on;

    if (st->chip_cfg.dmp_on) {
        MPU_SetDMPState(0);
        dmp_was_on = 1;
    } else
        dmp_was_on = 0;

    /* Get initial settings. */
    MPU_GetGyroFsr(&gyro_fsr);
    MPU_GetAccelFsr(&accel_fsr);
    MPU_GetLPF(&lpf);
    MPU_GetSampleRate(&sample_rate);
    sensors_on = st->chip_cfg.sensors;
    MPU_GetFIFOConfig(&fifo_sensors);

    get_st_biases(gyro_bias, accel_bias, 0);
    get_st_biases(gyro_st, accel_st, 1);

    accel_result = accel_self_test(accel_bias, accel_st);

    gyro_result = gyro_self_test(gyro_bias, gyro_st);

    result = 0;
    if (!gyro_result)
        result |= 0x01;
    if (!accel_result)
        result |= 0x02;

#ifdef AK89xx_SECONDARY
    compass_result = compass_self_test();
    if (!compass_result)
        result |= 0x04;
#else
    result |= 0x04;
#endif
	/* Set to invalid values to ensure no I2C writes are skipped. */
	st->chip_cfg.gyro_fsr = 0xFF;
	st->chip_cfg.accel_fsr = 0xFF;
	st->chip_cfg.lpf = 0xFF;
	st->chip_cfg.sample_rate = 0xFFFF;
	st->chip_cfg.sensors = 0xFF;
	st->chip_cfg.fifo_enable = 0xFF;
	st->chip_cfg.clk_src = INV_CLK_PLL;
	MPU_SetGyroFsr(gyro_fsr);
	MPU_SetAccelFsr(accel_fsr);
	MPU_SetAccelFsr(lpf);
	MPU_SetSampleRate(sample_rate);
	MPU_SetSensors(sensors_on);
	MPU_ConfigureFIFO(fifo_sensors);

	if (dmp_was_on)
		MPU_SetDMPState(1);

	return result;
}

